#Задание 1
#1.Ввести три числа m, n, p. Подсчитать количество отрицательных чисел.
m = int(input('Введите число m: '))
n = int(input('Введите число n: '))
p = int(input('Введите число p: '))
res = 0
for i in m, n, p:
    if i<0:
        res +=1
print('Количество отрицательных чисел:', res)



#Задание 2
#2. Торговая фирма в первый день работы реализовала товаров на P тыс. руб.,
#а затем ежедневно увеличивала выручку на 3%. Какой будет выручка фирмы в тот день,
#когда она впервые превысит заданное значение Q?
#Сколько дней придется торговать фирме для достижения этого результата?

P = int(input('Релизовано товаров на сумму: '))
Q = int(input('Заданное значение: '))

res = 0
while P < Q:
    P = round( ( ( (P/100)*3) + P), 2) #две цифры после запятой
    res += 1
print("Выручка фирмы в день превышения заданного значения", P)
print('Торговать необходимо дней:', res)



#Задание 3
#Сформировать одномерный список целых чисел A, используя генератор случайных чисел (диапазон от 0 до 99).
#Размер списка n ввести с клавиатуры. В соответствии со своим вариантом написать программу по условию,
#представленному в таблице ниже.

#Найти значение минимального элемента списка.
#Найти значение максимального элемента списка.

import random

List_A = []
for i in range(int(input("Enter a number: "))):
    List_A.append(random.randint(1,99))

print(List_A)
max = 0
min = 99
for num in List_A:
    if num > max:
        max = num
    if num <= min:
        min = num
print("Maximum value:", max)
print("Maximum value:", min)